too1/nrf52-ble-pong-central/main.c
void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

static void uart_init(void)
{
    uint32_t err_code;
     const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_DISABLED,
          false,
#if defined (UART_PRESENT)
          UART_BAUDRATE_BAUDRATE_Baud460800
#else
          NRF_UARTE_BAUDRATE_115200
#endif
      };

    APP_UART_FIFO_INIT(&comm_params,
                         16,
                         128,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);   
}

#define PERF_ENABLE 0

#define PERF_UPDATE_MS  250
#define PERF_REF_COUNT  284400
#define PERF_RUN()      NRF_TIMER3->TASKS_COUNT = 1

static void perf_update(void *p)
{
    NRF_TIMER3->TASKS_CAPTURE[0] = 1;
    NRF_LOG_INFO("Perf: %i", (((NRF_TIMER3->CC[0]) * 1000 / PERF_REF_COUNT)));
    NRF_TIMER3->TASKS_CLEAR = 1;
}

static void perf_init(void)
{
#if (PERF_ENABLE == 1)
    app_timer_create(&m_app_timer_perf_update, APP_TIMER_MODE_REPEATED, perf_update);
    app_timer_start(m_app_timer_perf_update, APP_TIMER_TICKS(PERF_UPDATE_MS), 0);
    
    NRF_TIMER3->MODE = TIMER_MODE_MODE_Counter << TIMER_MODE_MODE_Pos;
    NRF_TIMER3->BITMODE = TIMER_BITMODE_BITMODE_32Bit << TIMER_BITMODE_BITMODE_Pos;
    NRF_TIMER3->TASKS_START = 1;
#endif
}

int main(void)
{
    // Initialize.
    log_init();
    timer_init();
    leds_init();
    uart_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gatt_init();
    db_discovery_init();
    thingy_c_init();
    ble_conn_state_init();

    // Start execution.
    NRF_LOG_INFO("Thingy Pong started.");
    
    perf_init();   
    
    scan_start();
    
    pong_init();

    app_pong_start_game();
    
    app_display_init();
    
    for (;;)
    {
#if (PERF_ENABLE == 1)
        PERF_RUN();
        NRF_LOG_PROCESS();
#else
        idle_state_handle();
#endif
    }
}
